       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB15.
      *************************
      * AUTOR: SARAH
      * OBJETIVO: RECEBER DUAS VENDAS, CALCULE E IMPRIMA
      * A MÉDIA DESTAS VENDAS FORMATADAS EM TELA COM CIFRÃO
      * E CASAS DECIMAIS.
      * DATA: 14/03/2023
      *************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-VENDA1 PIC 9(5)         VALUE ZEROS.
       77 WRK-VENDA2 PIC 9(5)         VALUE ZEROS.
       77 WRK-MEDIA  PIC 9(5)         VALUE ZEROS.
       77 WRK-MEDIA-ED PIC $ZZ.ZZZ,99 VALUE ZEROS.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "ENTRE COM A 1a VENDA:"
           ACCEPT WRK-VENDA1.
           DISPLAY "ENTRE COM A 2a VENDA:"
           ACCEPT WRK-VENDA2.

      ***************************

           COMPUTE WRK-MEDIA = (WRK-VENDA1 + WRK-VENDA2)/2.
           DISPLAY 'MEDIA DE VENDAS ' WRK-MEDIA.
           MOVE WRK-MEDIA TO WRK-MEDIA-ED.
           DISPLAY 'MEDIA DE VENDAS ' WRK-MEDIA-ED.
            STOP RUN.
