           IDENTIFICATION DIVISION.
           PROGRAM-ID. PROGCOB01.
      *******************************
      * AREA DE COMENTÁRIOS - REMAKES
      * AUTOR = SARAH
      * OBJETIVO: MOSTRAR A STRING Olá Mundo
      * DIA = 09/03/2023
      *******************************
           ENVIRONMENT DIVISION.
           DATA DIVISION.
           PROCEDURE DIVISION.
               DISPLAY "Oi mundo".
               STOP RUN.
