        IDENTIFICATION DIVISION.
        PROGRAM-ID. PROGCOB01.
      ****************************************
      ** AUTOR = SARAH F. REZENDE
      ** OBJETIVO: MOSTRAR A STRING "Olá Mundo"
      ** DIA = 09/03/2023
      ****************************************
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        PROCEDURE DIVISION.
            DISPLAY "Oi mundo".
            STOP RUN.
